# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSet..::..Erase Method
GroundConductorSizeSet Class See Also
---
Removes a specified GroundConductorSize from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	GroundConductorSize item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As GroundConductorSize _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	GroundConductorSize^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..GroundConductorSizeThe GroundConductorSize to be erased.
# ### Return Value
The number of GroundConductorSizes that were erased from the set.
# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace